import React from 'react'
export default function Calculator() {
    return (
        <div>Здесь будет страница с Калькулятором.
            <div>Примерный сценарий:
                <p>если это возможно, то я бы хотел точный калькулятор высчитывания урона при каждой характеристике)</p>
                <i> нужны формулы каждой характеристики из игры, и просто нужно будет вписать урон от оружия(физический/магический, считай 2 отдельных калькулятора друг от друга), затем описываешь все свои характеристики в спец. Колонки( инта, мудрость, тут думаю понятно) система всё это считывает и выдаёт возможный урон, можно ещё добавить слабости и урон стихийный, но это уже мои заморочки) буду очень признателен если ты сделаешь такой калькулятор(можно без учёта слабостей и стихии атаки, т.к. в принципе это можно самому высчитать в своём калькуляторе, просто добавив готовый урон из твоего калькулятора)</i>
            </div>
        </div >
    )
}